Revit 2024 API
HermiteSplineTangents Class
 This class indicates tangency at the start, the end, or both ends of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class HermiteSplineTangents : IDisposable
Visual Basic
Public Class HermiteSplineTangents _
	Implements IDisposable
Visual C++
public ref class HermiteSplineTangents : IDisposable
Remarks
 Initially, the tangent vectors will not be set, and no tangency condition will be imposed when the curve is created.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.HermiteSplineTangents
See Also
HermiteSplineTangents Members
Autodesk.Revit.DB Namespace